using System;
using System.Windows.Forms;
using библиотекаИсполнителяПутник;

namespace исполнительПутник_v_2
{
    public class решениеЗадачи
    {
        Путник путник;
        гаммаЦветов цветЗакраски = гаммаЦветов.красный;
        public решениеЗадачи()
        {
            // Инициализация сгенерированной обстановки
            путник = new Путник("Inlet.in");
            try
            {
                while (путник.впередиСвободно)
                {
                    путник.сделатьШаг();
                    путник.закрасить(цветЗакраски);
                    if (путник.впередиПрепятствие == true)
                    {
                        путник.повернутьсяНалево();
                        путник.сделатьШаг();
                        путник.повернутьсяНаправо();
                        путник.сделатьШаг();
                        путник.сделатьШаг();
                        путник.повернутьсяНаправо();
                        путник.сделатьШаг();
                        путник.повернутьсяНалево();
                        путник.закрасить(цветЗакраски);
                        while (путник.впередиСвободно)
                        {
                            путник.сделатьШаг();
                            путник.закрасить(цветЗакраски);
                            if (путник.впередиПрепятствие == true)
                            {
                                break;
                            }
                        }
                    }
                }
                путник.работаЗавершена();             
            }
            catch (Exception сообщение)
            {
                //***********************************************************************************
                // Замечание:  Сообщения выводятся только при условии указания темы и номера задачи *
                //***********************************************************************************
                MessageBox.Show(сообщение.Message, "Причина ошибки");
                MessageBox.Show(путник.ToString(), "Место Путника в период ошибки");
            }
        }
               
    }
}
