using System;
using System.IO;

namespace построениеКлассаВектор_задача01
{
    /// <summary>
    /// Класс формирования файлов данных для решения задачи по теме "Класс Вектор"
    /// </summary>
    public class ФормировательФайлаДанных
    {
        int C;
        int[] вектор;
        /*
         *    Данные необходимо сформировать в файл Inlet.in в соотвествии со следующей легендой:
         *          Ввод (файл Inlet.in):
         *              С
         *              Элементы массива А по одному в строке
         *              
         *    Предусмотрим следующие варианты тестов:
         *       1. С = 1 - должен быть свормирован массив состоящий только из одного элемента - элемента с индексом 1
         *       2. С = 0 - критическая ситуация - ответ единственный элемент - элемент с интексом  0
         *       3. С = n-1 - критическая ситуация - ответ единственный элемент - элемент с индексом  n-1
         *       4. С = любое отрицательное - экстремальное значение - сгенерировать исключение
         *       5. С = значение большее, чем размерность массива - сгенерировать исключение
         *       6. С = любое положительное в пределах до размера вектора
         *       
         */
        /// <summary>
        /// Конструктор класса формирования набора данных в файл Inlet.in для работы с объектами класса Вектор задача 01
        /// </summary>
        /// <param name="вариантТестФайла">1 - для формирования объектом одно элементного вектора из элемента вектор[1]
        /// 2 - для формирования объектом одно элементного вектора из элемента вектор[0]
        /// 3 - для формирования объектом одно элементного вектора из элемента вектор[n-1]
        /// 4 - для проверки реагирования программы на исключение
        /// 5 - для проверки реагирования программы на исключение
        /// 6 - для формирования объектом много элементного вектора из элементов вектор-объекта</param>
        public ФормировательФайлаДанных(int вариантТестФайла)
        {

        }

    }
}
