using System;
using System.IO;

namespace Пример_решения_задачи_01
{
    /*
     *   Дан текстовый файл литерных величин Inlet.in.
     *   Подсчитать количество слов в данном файле и вывести в текстовый файл Outlet.out.
     *   
     *       Определение.
     *      Группы символов, разделенные пробелами (одним или несколькими) и не содержащие пробелов внутри себя, называются словами
     *      
     *       Ввод (файл Inlet.in):
     *     Строка символов
     *     Строка символов
     *     . . . . . . . . . . . . . . .
     *     Строка символов
     *     
     *       Вывод (файл Outlet.out):
     *     Количество слов
     */
    class Program
    {
        static StreamReader файлВВ = new StreamReader("Inlet.in");
        static StreamWriter файлЫВ = new StreamWriter("Outlet.out");

        static void Main(string[] args)
        {
            // Первый вариант решения. 
            //    Суть : создать массив предложений;
            //           подсчитать кол_во слов в каждом предложении
            /*
            string[] предложение;
            предложение = прочитатьТекст;
            int количествоСловТекста = подсчетКоличестваСлов(предложение);
             */
            // Второй вариант решения. 
            //    Суть : прочитать весь текст и сразу же выделить массив слов
            int количествоСловТекста = подсчетКоличестваСлов_в_Тексте;
            выводРезультата(количествоСловТекста);

        }
        static int подсчетКоличестваСлов_в_Тексте
        {
            get
            {
                char[] разделители = { '\n', '\r', ' ', '.', ',', ';', '?', '!', ':'};
                string[] слово = файлВВ.ReadToEnd().Split(разделители, System.StringSplitOptions.RemoveEmptyEntries);
                return слово.Length;
            }
        }
        static string[] прочитатьТекст
        {
            get
            {
                char[] символыКонцаСтроки = { '\n', '\r' };
                string[] предложение = файлВВ.ReadToEnd().Split(символыКонцаСтроки, System.StringSplitOptions.RemoveEmptyEntries);
                return предложение;
            }
        }
        static int подсчетКоличестваСлов(string[] предложение)
        {
            int количествоСлов = 0;
            for (int i = 0; i < предложение.Length; i++)
            {
                количествоСлов += количествоСлов_в_Предложении(предложение[i]);
            }
            return количествоСлов;
        }
        static int количествоСлов_в_Предложении(string предложение)
        {
            char[] разделительСлов = { ' ', '.', ',', ';', '?', '!', ':'};
            string[] слова = предложение.Split(разделительСлов, System.StringSplitOptions.RemoveEmptyEntries);
            return слова.Length;
        }
        static void выводРезультата(int количество)
        {
            файлЫВ.Write(количество);
            файлЫВ.Close();
        }
    }
}
